<?php
class TrackNumber
{
		// массив правил (regexp) для приведения к нормальному виду
	const RULES = [
			['search'=>'/[^\w|^\-|^\#]/', // разрешаем цифры, буквы, '_' и '-' '#'
				'replace'=>''], // оставляем цифры, буквы, и _
//			['search'=>'/[_]/',	
//				'replace'=>'']  // удаляем подчеркивание
		];
		
	const PATTERNS = [
			//	-------------------------------------------
		// _ means any symbol
		// # means any digit
			['vendor'=>'UPS', 'id'=>1,
				'regexp'=> [
					'/^1Z\w{16}$/'],
				'format'=> [
					'1Z________________' // 1Z + 16 symbols = 18
					]], 
			//	-------------------------------------------
			['vendor'=>'FedEx','id'=>2,
				'regexp'=> [
					'/^\d{12,13}$/',
					'/^\d{15,16}$/',
					'/^6129\d{16}$/',
					'/^9612\d{18}$/',
					'/^\d{34}$/'],
				'format'=>[
					'############', 	// 12#
					'#############', 	// 13#
					'###############',	// 15#
					'################',	// 16#
					'6129################',	// 20# = 6129 + 16#
					'9612##################', // 22# = 7# + 15#
					'##################################' // 34# = 22# + 12#
					]],
			//	-------------------------------------------
			['vendor'=>'USPS','id'=>3,
				'regexp'=> [
					'/^\d{20}$/',
					'/^3\d{18}$/',
					'/^9[12345]\d{20}$/',
					'/^420\d{5}9[12345]\d{20}$/',
					'/^9[23]\d{24}$/',
					'/^[^\d]{2}\d{9}[^\d]{2}$/',
					],
				'format'=> [
					'####################', // 20#
					'03##################', // 20# = '03' + 18#
					'3##################', // 19# = '3' + 19#
					'13##################',
					'14##################',
					'23##################',
					'7###################',
					'91####################', // 22# = '91' + 20#
					'92####################',
					'93####################',
					'94####################',
					'95####################',
					'420#####91####################', // 30#
					'420#####92####################',
					'420#####93####################',
					'420#####94####################',
					'420#####95####################',
					'92########################', // 26# = '92' + 24#
					'93########################', // 26# = '93' + 24#
					'__#########__'
				]],
			//	-------------------------------------------
			['vendor'=>'DHL','id'=>4,
				'regexp'=> [
					'/^\d{10}$/'],
				'format'=> [
					'##########'
					]], // 10 digits = 10
			//	-------------------------------------------
			['vendor'=>'Amazon', 'id'=>5,
				'regexp'=> [
					'/^TBA\d{12}$/'],
				'format'=> [
					'TBA############' // TBA + 12 digits = 15
					]], 
			//	-------------------------------------------
			['vendor'=>'Other','id'=>0,
				'regexp'=> [
					'/^.*$/'],
				'format'=> [
					''
					]]	
		];

	public static function trackingCanonize($tracking)
	{
		$tracking = mb_strtoupper($tracking);
		foreach (self::RULES as $rule)
			$tracking = preg_replace($rule['search'], $rule['replace'], $tracking); 
		return $tracking == '' ? false : $tracking;
	}
	
	public static function trackingAnalyze ($tracking)
	{
		$tracking = self::trackingCanonize($tracking);
	
		foreach (self::PATTERNS as $pattern) 
			foreach ($pattern['regexp'] as $regexp)
				if ( preg_match($regexp, $tracking) )
					return [
						'tracking'=>$tracking,
						'carrier_id'=>$pattern['id'],
						'carrier_name'=>$pattern['vendor']
					];
					
		return false;
	}	
	
}